[
    {
        "title": "Maintenance Technician Third Shift $4K sign-on bonus",
        "location": "PHL - Tioga - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=60945&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "Job Title : Maintenance Technician ( Third Shift )Reports to: Maintenance Manager + Production and Facilities ManagerHourly Rate : $27 - $30 + $2 shift differential. Sign-On Bonus : $4,000.00The Maintenance Technician  is responsible for repairing and ensuring the uptime of machines, electrical components, and general building maintenance for both the Tioga and Salmon Street Facilities . This position reports to the Maintenance Manager and the Production and Facilities Manager. The ideal candidate has a  high electromechanical aptitude, mental flexibility, and effective communication skills to serve La Colombe’s fast paced plant environments. Essential Duties and Responsibilities: - Other duties may be assigned Performs scheduled maintenance on plant equipment and machinery. Specifically, packing machines and coffee roasters. Responds to and corrects equipment stoppage/mechanical breakdowns in a timely manner.Maintains cleanliness of work area.Installs, maintains, and performs repairs on process equipment, mechanical components such as valves and piping, and electrical components such as transformers, circuit breakers, AC and DC motors, variable frequency drives, sensors, PLCs and HMIs, temperature control systems, monitoring instrumentation and other electrical systems.Diagnoses and performs basic repairs to plant infrastructure, such as HVAC, water, steam, and power systems. Initiates and manages specialist intervention when necessary.Develops knowledge and familiarity with mechanical / electrical drawings for equipment and plant infrastructure.Makes standard computations relating to load requirements of wiring and electrical equipment.Proficient with basic hand / power tools, measuring devices, and electrical testing. Preferred Experience and Skills:Associates degree in Electronics/Electrical Technology and/or three or more years’ experience in a hands-on technical role in a plant environment.Experience in HVAC; welding, electronics, electrical repairs, industrial equipment installations, alignment, start-up repairs, etc.Competent with computers and software including Microsoft Windows, Microsoft Word and Excel.Experience with PM and work order systems. Physical Requirements :Ability to reach above shoulder level, climb, balance, kneel, bend over, etc.Ability to use hands and fingers to assemble small objects, boxes, etc. Be physically active for 12 hours without becoming fatigued or out of breath.Stand for 12 hours a day. Frequently lift and or  move 40+ pounds Occasionally lift and or move 75+ pounds Perform heavy work exerting 50 to 100 pounds of force."
    },
    {
        "title": "3rd Shift Supervisor- Multiserve",
        "location": "Norton Shores Production Facility - Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=57365&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": ""
    },
    {
        "title": "Batching/CIP Technician - B Shift",
        "location": "Norton Shores Production Facility - Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=60657&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": ""
    },
    {
        "title": "Human Resource Generalist",
        "location": "Norton Shores Production Facility - Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=60480&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "The People Operations Generalist will be on site to support our Production facilities in Norton Shores MI. This is where our coffee beans are roasted and our cold brew coffee is brewed! They will lead and support diverse recruiting efforts, manage employee relations, performance development and help build a healthy people culture.  Ensure the people needs of the facilities are met by administering policies and procedures in a fair and consistent way. The People Operations Generalist will possess a high sense of responsibility, quality, ethics, and integrity. RECRUITMENT  Lead best in class sourcing efforts to keep the plant fully staffed with non exempt regular and temporary employees. Screen viable candidates and facilitate interviews with hiring managers.  Partner with Operations to proactively create recruitment plans by properly forecasting hiring needs with emphasis on strategic planning, internal development, and training.   PEOPLE & CULTURE Solve routine HR problems, take the time to suggest modifications to processes and procedures as appropriate. Help build a team and maintain engagement by providing an excellent employee experience. Communicate proactively, professionally, and positively with the team. Coach and advise the leadership team on people issues such as hiring, performance, career progression, employee relations and concerns, field visits, interviews, and exit interviews. Identify areas of opportunity for improved retention. Conduct and facilitate local training and development sessions as needed. Follow up with new hires to ensure adequate and proper training.  PAYROLL Bi-Weekly processes payroll and related transactions in compliance with all applicable Federal, State and county rules, regulations and ordinances; maintains information system databases (Paycom); enters data into computer systems accurately and in a timely manner, validates data and compiles documentation.  Generates payroll reports for Michigan facilities, reviews and makes changes to employee information for tax deductions and benefit deduction, wage assignments, federal and state levies, and child support garnishments.  Must be able to identify and resolve payroll problems before payroll is issued. POLICY & COMPLIANCE   Administers various human resources policies and procedures for all company personnel; assists in development and implementation of personnel policies. Continuously identify opportunities to streamline, improve or positively change current practices towards better employee experience and greater efficiency. Facilitate Plant Safety Committee. EMPLOYEE RELATIONS Serve as the primary point of contact for employee relations. Coach supervisory staff with performance issues and employee relations. BEST PRACTICES Possess and maintain working knowledge of trends and regulatory changes. Maintain knowledge and application of local labor laws as it relates to our industry and recommend policy changes and best practices to stay compliant."
    },
    {
        "title": "Plant Maintenance Technician 2nd Shift",
        "location": "Norton Shores Production Facility - Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=60132&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "At La Colombe, we relentlessly pursue innovation and push the bounds of traditional coffee expectations, delivering an industry-leading experience. We are on a mission to make people happy. Every.Single.Day. La Colombe is a fast-growing company with big dreams and goals from roasting to serving to partnering and beyond.We are currently seeking a Maintenance Technician on 2nd shift to join our coffee production facility in Norton Shores, MI. The Maintenance Technician is responsible for repairing machines and providing support regarding the usage of machines and electrical components and reports to the Production Manager. This role requires flexibility and interaction with all departments in the company and will encompass a variety of tasks – including:Perform scheduled production machines and equipment maintenance, including can filling/seaming, retort canning, and automated packaging equipment for milk processing.Respond to and correct breakdowns promptly, communicate effectively with operators to assist in diagnosis, and prevent future issues.Weld/fabricate to modify and repair vessels, piping, and other steel and stainless steel components.Maintain equipment subsystems/components and assist with installations.Diagnose and perform basic repairs to plant infrastructures, such as HVAC, water, steam, process gas, and low/high voltage power systems.Read and fully understand mechanical and electrical drawings for process equipment and plant infrastructure.$4,000 Sign-On BonusPay: Up to $35/hr based on experience2nd Shift = Additional $2.00 per hour shift differential"
    },
    {
        "title": "Processing Supervisor - Night Shift",
        "location": "Norton Shores Production Facility - Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=55652&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "At La Colombe, we relentlessly pursue innovation and have spent the last 25+ years pushing the boundaries of traditional coffee expectations. From our products' quality to our service's precision, La Colombe consistently delivers an industry-leading experience. We are on a mission to make people happy with coffee. Every. Single. Day. From roasting to serving to consulting and beyond, La Colombe is a fast-growing company with big dreams and goals. Our growth offers you this fantastic opportunity to get plugged into a leadership position! We are seeking Processing Shift Supervisor to oversee our daily operations of a production department consisting of multiple assembly lines and additional support equipment that operates 24-7. You will be responsible for leading and coordinating your team's activities in producing coffee/dairy products. Night shift, 5:00 p.m.-5:15 a.m. rotating two days per week plus every other Friday, Saturday, and Sunday. Ensuring company compliance in health and safety guidelines relevant to the food industry in a food manufacturing environmentAssist the Food Safety Manager in ensuring processes and procedures are in place and followed to ensure an incident-free workplaceResponsible for completion of forms related to injury and illness prevention, assist with corrective action regarding as neededAssist with educating managers and supervisors on proper food safetyMaintain training documentation, audits, and training meetingsImplement health and safety guidelines as mandated by State and Federal bodiesMaintain environmental testing and documents related toMaintain product for release, MSDS sheets, chemical list, and daily HAACP documentsAssist Food Safety Manager on processes regarding testing review, food safety team productivity, sanitation records, rework, and wasteResponsible for daily lot reports on daily runs"
    },
    {
        "title": "Barista",
        "location": "CHI - Wicker Park - Chicago, IL",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=63575&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "The Barista brings La Colombe to life by creating a world-class coffee experience.  Genuinely enjoys making people happy with coffee and thrives working in a fast-paced environment.  Seek opportunities to learn more about our coffee, company, and the La Colombe mission. Takes pride in being part of our team and embodies all of our One Dove principles- Kindness, Respect, Deliciousness, Efficiency, and Cleanliness.  PEOPLE:  Treat others with KINDNESS & RESPECT. Warmly welcome customers. Build relationships with repeat customers. Take the time to determine customers' coffee needs and interests and offer La Colombe products. Respect differences of others even when their values and ideas contrast with our own. Find opportunities to lead with kindness.  Seek to understand others. Work cooperatively with others on the team and with leadership. Communicate positively and professionally. When respect or safety is at stake, reach out to leadership or the people team to seek resolution. PRODUCT:   Deliver DELICIOUSNESS with EFFICIENCY. Display a graceful sense of urgency in completing tasks.Consistently meet La Colombe product recipes and quality standards.Serve quality beverages in a timely and engaging manner. Record and accurately process purchases using the POS system, collect and process payments, apply discounts according to La Colombe standards. Work with cafe leadership and technical department to help administer quality control.Complete required training in a timely manner. Coach fellow baristas on our quality and expectations PLACE:  Demonstrate cafe pride by making CLEANLINESS and safety a priority. Work cleanly and safely. Handle hot beverages with care.Follow all COVID-19 protocols and meet cleanliness standards. Clean coffee grinder, brewer, and espresso machines.Organize products on our shelves and restock as necessaryActively identify any additional safety hazards and escalate to Cafe Leadership.Complete opening and closing tasks and checklists. Participate in weekly, monthly and quarterly deep cleans of the cafe. Proactively maintain and improve the appearance of the Cafe and coffee bar. Sanitize and clean the cafe area as needed throughout the shift."
    },
    {
        "title": "Barista",
        "location": "LA - Beverly Hills - Beverly Hills, CA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=63476&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "The Barista brings La Colombe to life by creating a world-class coffee experience.  Genuinely enjoys making people happy with coffee and thrives working in a fast-paced environment.  Seek opportunities to learn more about our coffee, company, and the La Colombe mission. Takes pride in being part of our team and embodies all of our One Dove principles- Kindness, Respect, Deliciousness, Efficiency, and Cleanliness.  PEOPLE:  Treat others with KINDNESS & RESPECT. Warmly welcome customers. Build relationships with repeat customers. Take the time to determine customers' coffee needs and interests and offer La Colombe products. Respect differences of others even when their values and ideas contrast with our own. Find opportunities to lead with kindness.  Seek to understand others. Work cooperatively with others on the team and with leadership. Communicate positively and professionally. When respect or safety is at stake, reach out to leadership or the people team to seek resolution. PRODUCT:   Deliver DELICIOUSNESS with EFFICIENCY. Display a graceful sense of urgency in completing tasks.Consistently meet La Colombe product recipes and quality standards.Serve quality beverages in a timely and engaging manner. Record and accurately process purchases using the POS system, collect and process payments, apply discounts according to La Colombe standards. Work with cafe leadership and technical department to help administer quality control.Complete required training in a timely manner. Coach fellow baristas on our quality and expectations PLACE:  Demonstrate cafe pride by making CLEANLINESS and safety a priority. Work cleanly and safely. Handle hot beverages with care.Follow all COVID-19 protocols and meet cleanliness standards. Clean coffee grinder, brewer, and espresso machines.Organize products on our shelves and restock as necessaryActively identify any additional safety hazards and escalate to Cafe Leadership.Complete opening and closing tasks and checklists. Participate in weekly, monthly and quarterly deep cleans of the cafe. Proactively maintain and improve the appearance of the Cafe and coffee bar. Sanitize and clean the cafe area as needed throughout the shift."
    },
    {
        "title": "Barista",
        "location": "NYC - Terminal Warehouse - New York, NY",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=63464&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "The Barista brings La Colombe to life by creating a world-class coffee experience.  Genuinely enjoys making people happy with coffee and thrives working in a fast-paced environment.  Seek opportunities to learn more about our coffee, company, and the La Colombe mission. Takes pride in being part of our team and embodies all of our One Dove principles- Kindness, Respect, Deliciousness, Efficiency, and Cleanliness.  PEOPLE:  Treat others with KINDNESS & RESPECT. Warmly welcome customers. Build relationships with repeat customers. Take the time to determine customers' coffee needs and interests and offer La Colombe products. Respect differences of others even when their values and ideas contrast with our own. Find opportunities to lead with kindness.  Seek to understand others. Work cooperatively with others on the team and with leadership. Communicate positively and professionally. When respect or safety is at stake, reach out to leadership or the people team to seek resolution. PRODUCT:   Deliver DELICIOUSNESS with EFFICIENCY. Display a graceful sense of urgency in completing tasks.Consistently meet La Colombe product recipes and quality standards.Serve quality beverages in a timely and engaging manner. Record and accurately process purchases using the POS system, collect and process payments, apply discounts according to La Colombe standards. Work with cafe leadership and technical department to help administer quality control.Complete required training in a timely manner. Coach fellow baristas on our quality and expectations PLACE:  Demonstrate cafe pride by making CLEANLINESS and safety a priority. Work cleanly and safely. Handle hot beverages with care.Follow all COVID-19 protocols and meet cleanliness standards. Clean coffee grinder, brewer, and espresso machines.Organize products on our shelves and restock as necessaryActively identify any additional safety hazards and escalate to Cafe Leadership.Complete opening and closing tasks and checklists. Participate in weekly, monthly and quarterly deep cleans of the cafe. Proactively maintain and improve the appearance of the Cafe and coffee bar. Sanitize and clean the cafe area as needed throughout the shift."
    },
    {
        "title": "Laborer",
        "location": "PHL - Salmon St - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=62669&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "The Laborer will work directly with the Brew Supervisor on ensuring quality and consistency throughout the concentrate production process. The Laborer will assist in loading and unloading coffee, cleaning brew tanks, keeping detailed production records and ensuring a steady flow of concentrate. The ideal candidate is a self motivated individual who can easily follow SOPs and work instructions.Reports to : Concentrate Production Manager & Brew Supervisor Shift Hours : 7pm - 3:30amHourly Rate : $17.00 + $2.00 shift differential. Essential Duties and Responsibilities: -Other duties may be assigned Load and unload materials as needed.Follow all SOPs and work instructions related to production.Set equipment parameters for operation.Perform quality checks as required.Perform sanitation on brew tanks and other equipment. Monitor Inventory to ensure a consistent flow of concentrate production.Maintain accurate production record keeping daily. Operate forklift trucks (preferred but not required) and pallet jacks Follow all policies and procedures, including Safety.Job Requirements:Able to add, subtract, multiply and divide in all units of measure, using whole numbers, common fractions and decimals.Experience within the food and beverage industry is preferred.Must be able to work in a wet environment. Some exposure to cleaning chemicals.Must be willing to work flexible hours including overtime.Be able to effectively work in a team environment.Effective verbal and written communication skills.Ability to work in a fast paced environment.Physical Requirements :Ability to reach above shoulder level, climb, balance, kneel, bend over, etc.Ability to use hands and fingers to assemble small objects, boxes, etc. Be physically active for 8 hours without becoming fatigued or out of breath.Stand for 8 hours a day. Frequently lift and or  move 40+ pounds Occasionally lift and or move 75+ pounds Frequently push 300-400 lbs  on a rolling cart, sometimes at an incline."
    },
    {
        "title": "Pasteurizer Operator",
        "location": "PHL - Salmon St - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=62552&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "Pasteurizer operators are responsible for following Standard Operating Procedure while operating our HTST skid to produce high-quality pasteurized coffee concentrate . The Pasteurizer  will work directly with the Brew Supervisor to ensure quality and consistency throughout the process. The pasteurizer  is also responsible for communicating to the brewer/laborer team.Shift Hours : 7pm - 3:30am (Monday - Friday) Hourly Rate : $20.50 ($18.50 base pay + $2.00 shift differential for all hours worked) Essential Duties and Responsibilities: -Other duties may be assigned Mix and blend ingredients to create various batches.Minimize product lossAlert leaders of any Food Safety or Quality issues or of any processes which become non-compliant with specified requirementsPerform all necessary Clean in Place (CIP) of all tanks, line circuits, and associated equipmentCompletes paper work recording number of gallons pasteurized, temperatures, time, etc.CIP pasteurizer at the end of each run; use correct chemicals safely and accurately while following all CIP stepsFollows all company policies and procedures regarding GMP’s, SOP’s and Quality standardsSet equipment parameters for operation.Perform quality checks as required.Perform sanitation.Maintain records daily.Operate forklift trucks a bonusFollow all policies and procedures, including Safety.Job Requirements:Able to add, subtract, multiply and divide in all units of measure, using whole numbers, common fractions and decimals.Experience within the food and beverage industry is preferred.Must be able to work in a wet environment. Some exposure to cleaning chemicals.Must be willing to work flexible hours including overtime.Be able to effectively work in a team environment.Effective verbal and written communication skills.Ability to work in a fast paced environment.Physical Requirements :Ability to reach above shoulder level, climb, balance, kneel, bend over, etc.Ability to use hands and fingers to assemble small objects, boxes, etc. Be physically active for 8 hours without becoming fatigued or out of breath.Stand for 8 hours a day. Frequently lift and or  move 40+ pounds Occasionally lift and or move 75+ pounds Frequently push 300-400 lbs  on a rolling cart, sometimes at an incline."
    },
    {
        "title": "Shipping & Receiving Associate Night Shift",
        "location": "PHL - Tioga - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=62246&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "Job Title: Shipping and Receiving Associate Shift : 3pm - 11:30pm ( Monday - Friday )Hourly Rate : $16.00 + $1.00 shift differential The Shipping and Receiving Associate verifies and maintains records on incoming and outgoing shipments and prepares items for shipment by performing the following duties to quality and productivity standards. Demonstrates strong organizational skill, attention to detail and the ability to balance multiple projects at once. Demonstrates strong technical capabilities and can adapt to new systems with ease.Self Motivated and capable of working independently and with a team. Excellent time management and prioritization skills. Demonstrates a thorough work ethic and follows through on all tasks and daily functions.Excellent verbal / written communication skills.  Essential Duties and Responsibilities: - other duties may be assigned Unpacks, examines and routes incoming shipments, rejects damaged items, records shortages and coordinates with shipper to rectify damages and shortages. Receives and processes all defective units returned for replacement or credit. Maintains inventory of shipping materials and suppliesMaintains raw material and communicates needs with the warehouse. Performs computer functions necessary to track various aspects of goods. Reports defective product or questionable conditions to the department supervisor Maintains a neat and orderly work area and follows prescribed safety regulationsAssists in weekly inventory counts and monthly cycle counts Must be available to work flexible hours and overtime on weekends and holidays.  Required Education, Experience and Skills:High School Diploma or General Education Degree preferred.1-2 years of relevant experience in Shipping and Receiving Proficiency in MS suite applications ( Word, Excel, Powerpoint, etc. )Proficiency working with office equipment ( printers, scanners, desk phone, etc ). Physical Requirements :Ability to reach above shoulder level, climb, balance, kneel, bend over, etc.Ability to use hands and fingers to assemble small objects, boxes, etc. Be physically active for 8 hours without becoming fatigued or out of breath.Stand for 8 hours a day. Frequently lift and or  move 40+ pounds Occasionally lift and or move 75+ pounds Frequently push 300-400 lbs  on a rolling cart, sometimes at an incline."
    },
    {
        "title": "Inventory Specialist",
        "location": "MI Warehouse Facility - Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=61637&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "The primary responsibilities of this role will be to manage the inventory control system, maintain product data, rectify miscalculations, review and analyze the results of operations, report findings to management and make recommendations for improvement as necessary.The inventory specialist position verifies and keeps records on incoming and outgoing shipments.Essential functions:Required to conduct and be responsible for weekly inventory counts and monthly cycle countsAbility to order and track raw materials for productionHandle dock appointments of incoming shipmentsResponsible for coordinating with the Buyer on all involved external shipments (ie Rejecting damaged goods, recording shortages, etc)Handle warehouse organization in accompaniment with other leadersMaintains inventory of shipping raw materials, supplies, and finished goodsPerforms all computer functions necessary to track various aspects of goodsOrganize and file shipping documentsAssists the Logistics Coordinator in providing required materials for productionSupports the shipment of goods produced and the received goods and supplies to be used in or to aid in the production/storage of goods destined for sale to our warehouseMaintains the distribution of various dunnageComplete raw material inspections as required by the Quality teamReports defective materials or questionable conditions to the department supervisorMaintains the work area and equipment in a clean and orderly condition and follows prescribed safety regulationsMay assist with unpacking and examining incoming goodsAbility to work a rotating weekend schedule required including holidays"
    },
    {
        "title": "Night Shift Receiving Coordinator",
        "location": "MI Warehouse Facility - Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=58155&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "Must be able to work a 12-hour shift schedule, including rotating weekendsSupports the quality system knowledge including the quality manual, quality policy, and applicable procedures and work instructionsEnsures products and supplies are unloaded, received, and loaded on the dock in an efficient, accurate and safe mannerResponsible for skid wrapping where requiredVerifies packing slips for correct products and amountsCompletes all necessary paperwork and filing in complete and accurate mannerAccurately prints and labels productCoordinates placement of raw materials, supplies, and finished goods in proper location after inspections are completedWeekly/Month-End department cycle counts as requiredConstant communication with Logistics team and all Production departmentsParticipates positively in department meetingsOperates Hi-Lo, pallet jacks and other machinery in a safe manner at all timesReports safety concerns to supervisorCross trains with Warehouse positions and fills in as neededMaintains and displays strong attendance habits by being present and on time"
    },
    {
        "title": "Sous Chef",
        "location": "PHL - Fishtown - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=60897&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "SOUS CHEFThe Sous Chef is responsible for the daily execution of our savory grab-and-go program and a small selection of hot food items available exclusively in the Fishtown cafe.  They manage the daily operation of the savory kitchen and can be tasked with hiring, training, team development, menu development, and working stations. They will manage a staff of cooks and dishwashers, and work closely with the back-of-house teams as a trainer and leader but also collaborate with the FOH leaders to maintain alignment with the business.  The Sous Chef will report directly to the Executive Chef, manage a team of approximately 10 people, and oversee sales of approximately $1 million annually in Philadelphia. The Sous Chef possesses a high sense of responsibility, quality, ethics, and integrity.   PEOPLE & CULTURE Study existing menus, and personally develop the techniques needed to execute the menu items. Educate and direct the staff throughout kitchen service. Understand the cleaning schedules and manage all savory kitchen employees including porters. Promote and practice safe work habits through training, education, and documentation of proper procedures. Identify the root cause of safety incidents and rectify them accordingly. Review their team's time punches accurately and timely. Oversee operations of the kitchen to maximize service and enhance the guest experience.   Hold the team accountable for following La Colombe’s policies and procedures. FOOD QUALITY Ensure teams consistently meet food storage and safety standards. Uphold food and presentation quality standards. Learn any menu changes or additions and prepare accordingly. Seek out opportunities to find superior ingredients at a lower cost. Find new ways to grow grab-and-go sales, by testing and executing new items for our fridges.  Find ways to minimize waste, while also managing fully stocked fridges. HEALTH & SAFETY Follow all COVID-19 protocols and meet cleanliness standards. Keeping storage spaces organized and enforcing labeling of all items.  Ensure that all safety protocols are followed even when you are not present. Maintaining log books including temperature and receiving logs. Ensure safety, harassment, injuries, or any other issues brought to your attention are reported and addressed immediately. Complete Monthly Health Inspection Checklist and maintain food service manager health certificate. BUSINESS MANAGEMENTDevelop and maintain a labor schedule that is efficient and cost-effective. Complete payroll and admin tasks accurately and on time. Order all products on a weekly basis and maintain an up-to-date order guide. Assist with building sales consistently and deliberately.  Manage controllable costs effectively. Proactively research, implement, and develop innovative ideas."
    },
    {
        "title": "Barista",
        "location": "CHI - Armitage - Chicago, IL",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=60512&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "The Barista brings La Colombe to life by creating a world-class coffee experience.  Genuinely enjoys making people happy with coffee and thrives working in a fast-paced environment.  Seek opportunities to learn more about our coffee, company, and the La Colombe mission. Takes pride in being part of our team and embodies all of our One Dove principles- Kindness, Respect, Deliciousness, Efficiency, and Cleanliness.  PEOPLE:  Treat others with KINDNESS & RESPECT. Warmly welcome customers. Build relationships with repeat customers. Take the time to determine customers' coffee needs and interests and offer La Colombe products. Respect differences of others even when their values and ideas contrast with our own. Find opportunities to lead with kindness.  Seek to understand others. Work cooperatively with others on the team and with leadership. Communicate positively and professionally. When respect or safety is at stake, reach out to leadership or the people team to seek resolution. PRODUCT:   Deliver DELICIOUSNESS with EFFICIENCY. Display a graceful sense of urgency in completing tasks.Consistently meet La Colombe product recipes and quality standards.Serve quality beverages in a timely and engaging manner. Record and accurately process purchases using the POS system, collect and process payments, apply discounts according to La Colombe standards. Work with cafe leadership and technical department to help administer quality control.Complete required training in a timely manner. Coach fellow baristas on our quality and expectations PLACE:  Demonstrate cafe pride by making CLEANLINESS and safety a priority. Work cleanly and safely. Handle hot beverages with care.Follow all COVID-19 protocols and meet cleanliness standards. Clean coffee grinder, brewer, and espresso machines.Organize products on our shelves and restock as necessaryActively identify any additional safety hazards and escalate to Cafe Leadership.Complete opening and closing tasks and checklists. Participate in weekly, monthly and quarterly deep cleans of the cafe. Proactively maintain and improve the appearance of the Cafe and coffee bar. Sanitize and clean the cafe area as needed throughout the shift."
    },
    {
        "title": "Barista",
        "location": "CHI - Randolph - Chicago, IL",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=59273&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "The Barista brings La Colombe to life by creating a world-class coffee experience.  Genuinely enjoys making people happy with coffee and thrives working in a fast-paced environment.  Seek opportunities to learn more about our coffee, company, and the La Colombe mission. Takes pride in being part of our team and embodies all of our One Dove principles- Kindness, Respect, Deliciousness, Efficiency, and Cleanliness.  PEOPLE:  Treat others with KINDNESS & RESPECT. Warmly welcome customers. Build relationships with repeat customers. Take the time to determine customers' coffee needs and interests and offer La Colombe products. Respect differences of others even when their values and ideas contrast with our own. Find opportunities to lead with kindness.  Seek to understand others. Work cooperatively with others on the team and with leadership. Communicate positively and professionally. When respect or safety is at stake, reach out to leadership or the people team to seek resolution. PRODUCT:   Deliver DELICIOUSNESS with EFFICIENCY. Display a graceful sense of urgency in completing tasks.Consistently meet La Colombe product recipes and quality standards.Serve quality beverages in a timely and engaging manner. Record and accurately process purchases using the POS system, collect and process payments, apply discounts according to La Colombe standards. Work with cafe leadership and technical department to help administer quality control.Complete required training in a timely manner. Coach fellow baristas on our quality and expectations PLACE:  Demonstrate cafe pride by making CLEANLINESS and safety a priority. Work cleanly and safely. Handle hot beverages with care.Follow all COVID-19 protocols and meet cleanliness standards. Clean coffee grinder, brewer, and espresso machines.Organize products on our shelves and restock as necessaryActively identify any additional safety hazards and escalate to Cafe Leadership.Complete opening and closing tasks and checklists. Participate in weekly, monthly and quarterly deep cleans of the cafe. Proactively maintain and improve the appearance of the Cafe and coffee bar. Sanitize and clean the cafe area as needed throughout the shift."
    },
    {
        "title": "Barista",
        "location": "BOS - South Station - Boston, MA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=58197&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "The Barista brings La Colombe to life by creating a world-class coffee experience.  Genuinely enjoys making people happy with coffee and thrives working in a fast-paced environment.  Seek opportunities to learn more about our coffee, company, and the La Colombe mission. Takes pride in being part of our team and embodies all of our One Dove principles- Kindness, Respect, Deliciousness, Efficiency, and Cleanliness.  PEOPLE:  Treat others with KINDNESS & RESPECT. Warmly welcome customers. Build relationships with repeat customers. Take the time to determine customers' coffee needs and interests and offer La Colombe products. Respect differences of others even when their values and ideas contrast with our own. Find opportunities to lead with kindness.  Seek to understand others. Work cooperatively with others on the team and with leadership. Communicate positively and professionally. When respect or safety is at stake, reach out to leadership or the people team to seek resolution. PRODUCT:   Deliver DELICIOUSNESS with EFFICIENCY. Display a graceful sense of urgency in completing tasks.Consistently meet La Colombe product recipes and quality standards.Serve quality beverages in a timely and engaging manner. Record and accurately process purchases using the POS system, collect and process payments, apply discounts according to La Colombe standards. Work with cafe leadership and technical department to help administer quality control.Complete required training in a timely manner. Coach fellow baristas on our quality and expectations PLACE:  Demonstrate cafe pride by making CLEANLINESS and safety a priority. Work cleanly and safely. Handle hot beverages with care.Follow all COVID-19 protocols and meet cleanliness standards. Clean coffee grinder, brewer, and espresso machines.Organize products on our shelves and restock as necessaryActively identify any additional safety hazards and escalate to Cafe Leadership.Complete opening and closing tasks and checklists. Participate in weekly, monthly and quarterly deep cleans of the cafe. Proactively maintain and improve the appearance of the Cafe and coffee bar. Sanitize and clean the cafe area as needed throughout the shift."
    },
    {
        "title": "Day Shift Receiving Coordinator",
        "location": "MI Warehouse Facility - Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=58163&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "Must be able to work a 12-hour shift schedule, including rotating weekendsSupports the quality system knowledge including the quality manual, quality policy, and applicable procedures and work instructionsEnsures products and supplies are unloaded, received, and loaded on the dock in an efficient, accurate and safe mannerResponsible for skid wrapping where requiredVerifies packing slips for correct products and amountsCompletes all necessary paperwork and filing in complete and accurate mannerAccurately prints and labels productCoordinates placement of raw materials, supplies, and finished goods in proper location after inspections are completedWeekly/Month-End department cycle counts as requiredConstant communication with Logistics team and all Production departmentsParticipates positively in department meetingsOperates Hi-Lo, pallet jacks and other machinery in a safe manner at all timesReports safety concerns to supervisorCross trains with Warehouse positions and fills in as neededMaintains and displays strong attendance habits by being present and on time"
    },
    {
        "title": "Barista",
        "location": "LA - Century City - Los Angeles, CA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=58133&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "As a barista at La Colombe you're responsible for maintaining the overall feel of your cafe. You will be the eyes and\rears of the operation - the face of the space. You are responsible for maintaining the La Colombe experience for\rour customers."
    },
    {
        "title": "Baker",
        "location": "PHL - Fishtown - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=58000&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "Artisan Bread Shaper / Baker - PT/FT both available.Job Description: As an important member of La Colombe’s Flagship Café in Fishtown, the baker contributes to the culinary experience of our guests by producing delicious and beautiful baguettes, sourdoughs, challah, ciabatta, and more. Applicants must be able to work in a fast-paced, high-volume environment. The position requires early morning hours (430 AM). Ideal candidate will be a capable shaper/baker who can contribute strongly right away, without extensive training. Compensation will be based on experience. Duties and ResponsibilitiesOpening and preparing work stations for the daily bakePortioning and hand-shaping a variety of free-form rustic loaves Baking baguettes, sourdoughs, and more in a deck ovenNeatly arranging bread displays for retailSuccessfully balancing shaping/baking dutiesProper usage of commercial equipment including mixers, ovens, and knivesInspect food preparation and serving areas to ensure observance of safe, sanitary food-handling practicesQuality ControlAdhere to timing standards and schedules for all products and servicesMaintain clean, safe, and sanitary stations (shaping room, ovens, walk-in cooler, etc.)Properly clean and maintain equipmentComplete other general bakery tasks as assigned."
    },
    {
        "title": "Labor Relations Sr Manager",
        "location": "Remote - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=56856&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "The Labor Relations Sr. Manager is responsible for all labor relations matters and related employee relations matters. This role will be the chief spokesperson in labor negotiations and will have primary responsibility for labor contract administration. This includes planning for, negotiating and implementing collective bargaining agreements and renewals. This role will represent the Company in arbitrations and before the National Labor Relations Board. The Labor Relations Sr. Manager will respond to union organizing activity and train managers on employee relations matters including card check neutrality (CCN) campaigns. This position offers the flexibility to work from home, however, significant travel is required to allow in-person participation in training, organizing activities, negotiations, arbitrations, proceedings, etc.Your Main ResponsibilitiesPrepares and negotiates initial and renewal labor agreementsDevelops cost models for use during economic negotiations.Coordinates with operations managers, people partners, and leadership to obtain alignment on negotiations strategy and direction.Drafts contract proposals and counter proposals prior to and during negotiations.Finalizes settlements and prepares contract documents for final signature by the parties.Prepares and distributes contract settlement summaries to operations managers, people partners and leadership.Drafts and distributes regular executive summaries to the executive team.Handles all litigation with outside counsel for both union and non-union employees. Proactively interact with and advise operations managers, people partners and leadership to keep them aware of the negotiation process and outcomes. Informs group on a broad range of employment and labor relations matters, including disciplinary actions, contract administration and general methods of positive employee relations.Creates presentations and conducts training to inform operations managers, people partners and leadership regarding labor relations issues. Conducts management training related to Positive Employee Relations and other timely topics.Manages arbitrations, grievances and unfair labor practice charges including drafting, opening and closing briefs.Contributes to the development and improvement of Company-wide standardized practices, processes and forms.Collaborates to ensure legal compliance by reviewing federal, state, and local regulatory requirements and disseminating, explaining, and consulting regarding those requirements.Manages union contracts and is responsible for developing and maintaining relationships with union leadership and agents.Prepares for and assists operations managers and regional leadership in dealing with potential labor disputes, strikes, work stoppages and other concerted activity, including advising on appropriate courses of action involving satisfactory resolution of disputes, security issues, employee concerns and media/public relations considerations.Provides insights on labor relations trends and patterns and translates them into proactive proposals.Facilitates meetings for cross functional stakeholders to evolve policies where appropriate for union and non-union employees, when applicable.Works with external vendors to develop and deliver proposed labor relations related services on-time and within budget.Performs other duties as assigned or requested."
    },
    {
        "title": "Inventory Supervisor",
        "location": "MI Warehouse Facility - Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=56663&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "Responsible for the supervision of the inventory team to ensure accurate and timely inventory data for Michigan. This position requires excellent analytical skills, experience in inventory management and variance analysis to ensure that our raw material and finished good inventory is accurate on a real time basis. This will require the ability to reconcile physical versus book inventory and cost accounting variances and analysis of COGS by product line. This position will\roversee the auditing of real-time transactions by our Michigan plant and warehouses on a daily basis.• Coordinate the timeliness, accuracy, and completeness of activities for plant and warehouse teams via auditing and reporting.\r• Supervise daily cycle counts and annual physical and reconcile to book inventory.\r• Inventory management and variance analysis and the ability to perform at high levels in a fast paced, dynamic environment.\r• Assure uninterrupted supply of required materials via the use of various tools, including materials planning reporting. Plan based on historical consumption levels, forecasts received, and other considerations.\r• Achieve sustained inventory accuracy goals and manage effective cycle count and physical inventory processes.\r• Manage excess stocks to minimal levels, assure minimal backorders.\r• Identify and resolve supply chain related problems in day-to-day activities to increase overall efficiency and productivity.\r• Works with management to address all aspects of commodity management, including procurement support, production plans, and raw material availability.\r• Responsible for reporting of disposals of raw material and finished goods.\r• May perform all duties of inventory and warehouse personnel as required by workflow and staffing levels.\r• May perform other duties as assigned."
    },
    {
        "title": "Barista",
        "location": "LA - Silver Lake - Los Angeles, CA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=56095&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": ""
    },
    {
        "title": "Barista",
        "location": "NYC - Hudson - New York, NY",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=55858&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "As a barista at La Colombe you're responsible for maintaining the overall feel of your cafe. You will be the eyes and ears of the operation - the face of the space. You are responsible for maintaining the La Colombe experience for our customers.\rJOB REQUIREMENTSRegularly required to handle hot beverages\rBasic money handling skills\rBasic understanding of computer POS system\rFrequently required to use hand and finger motions, handle or feel objects, reach with hands and arms.\rAble to stand for long hours\rAble to lift and carry up to 40 lbs\rHigh organizational ability and detail oriented\rExcellent communication skills\rReliableESSENTIAL FUNCTIONS\rEssential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the jobs purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions for which the person in the job is held accountable. Following are the essential functions of the job.\rWelcomes customers by determining their coffee interest and needs\rTake customers orders accurately. Responds proactively to prevent customer service situations\rOperates coffee grinder, brewer and espresso machines; cleans machinery as needed.\rPrepares and sells coffee drinks by following recipes and preparation techniques for different coffee drinks.\rAble to work in a high volume, fast paced environment\rMaintains safe and healthy work environment by following organization standards and sanitation regulations.\rMaintaining and improving the appearance of store and coffee bar.\rRecord and accurately process purchases using the POS system, collect and process payments from the customer including cash, credit and debit cards."
    },
    {
        "title": "Barista",
        "location": "NYC - Bryant Park - New York, NY",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=55851&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "As a barista at La Colombe you're responsible for maintaining the overall feel of your cafe. You will be the eyes and ears of the operation - the face of the space. You are responsible for maintaining the La Colombe experience for our customers.\rJOB REQUIREMENTSRegularly required to handle hot beverages\rBasic money handling skills\rBasic understanding of computer POS system\rFrequently required to use hand and finger motions, handle or feel objects, reach with hands and arms.\rAble to stand for long hours\rAble to lift and carry up to 40 lbs\rHigh organizational ability and detail oriented\rExcellent communication skills\rReliableESSENTIAL FUNCTIONS\rEssential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the jobs purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions for which the person in the job is held accountable. Following are the essential functions of the job.\rWelcomes customers by determining their coffee interest and needs\rTake customers orders accurately. Responds proactively to prevent customer service situations\rOperates coffee grinder, brewer and espresso machines; cleans machinery as needed.\rPrepares and sells coffee drinks by following recipes and preparation techniques for different coffee drinks.\rAble to work in a high volume, fast paced environment\rMaintains safe and healthy work environment by following organization standards and sanitation regulations.\rMaintaining and improving the appearance of store and coffee bar.\rRecord and accurately process purchases using the POS system, collect and process payments from the customer including cash, credit and debit cards."
    },
    {
        "title": "Barista",
        "location": "CHI - Gold Coast - Chicago, IL",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=55592&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "As a barista at La Colombe you're responsible for maintaining the overall feel of your cafe. You will be the eyes and ears of the operation - the face of the space. You are responsible for maintaining the La Colombe experience for our customers.\rJOB REQUIREMENTSRegularly required to handle hot beverages\rBasic money handling skills\rBasic understanding of computer POS system\rFrequently required to use hand and finger motions, handle or feel objects, reach with hands and arms.\rAble to stand for long hours\rAble to lift and carry up to 40 lbs\rHigh organizational ability and detail oriented\rExcellent communication skills\rReliableESSENTIAL FUNCTIONS\rEssential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the jobs purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions for which the person in the job is held accountable. Following are the essential functions of the job.\rWelcomes customers by determining their coffee interest and needs\rTake customers orders accurately. Responds proactively to prevent customer service situations\rOperates coffee grinder, brewer and espresso machines; cleans machinery as needed.\rPrepares and sells coffee drinks by following recipes and preparation techniques for different coffee drinks.\rAble to work in a high volume, fast paced environment\rMaintains safe and healthy work environment by following organization standards and sanitation regulations.\rMaintaining and improving the appearance of store and coffee bar.\rRecord and accurately process purchases using the POS system, collect and process payments from the customer including cash, credit and debit cards."
    },
    {
        "title": "CPG Strategy & Ops, Demand Planning Analyst",
        "location": "PHL - Fishtown Offices - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=54792&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "HOW YOU WILL CONTRIBUTE TO LA COLOMBE'S MISSIONPURPOSE: The CPG Operations & Strategy, Demand Planning Analyst supports the growing CPG business as a demand planning expert. By compiling the insights and ambitions of our sales and marketing teams, while analyzing sales trends and opportunities, this individual will facilitate customer-level planning, shaping key aspects of the CPG business.YOUR MAIN RESPONSIBILITIESDEMAND PLANNING Develop effective forecast models based on trends and demand patterns Collaborate with sales and marketing teams to produce accurate and actionable forecasts for implementation with supply chain and production teamsForecast new CPG product launches for both RTD & Roasted opportunities Propose and implement solutions to improve demand forecast accuracy  STRATEGY & ANALYSIS Identify, distinguish, and drive strategic initiatives and analyses that support the the CPG business objectives in both short-term and long-range planning. Support execution of key strategic initiatives aimed at driving better business performance, including supporting sales activities, actionable demand planning, and trade spend optimization.CUSTOMER SUCCESS Support the CPG sales team to foster customer success & growth Evaluate customer inventory & turns through distributor and customer portals Provide recommendations to enhance customer assortment and productivity Support GTM customer-level strategy via ad hoc reports pertaining to performance, pricing, promotions/accruals, and other customer responsibilitiesVALUE CREATION As a key member of the CPG team find ways to collaborate with others and lead projects that add value to the business unit  Gather, develop, and disseminate all regular business reporting; lead efforts to automate channel level sales reporting  Identify areas of impact that reduce costs, and, or drive top-line growthAnalyze upcoming trade promotion events and forecast accuracyAssess and monitor production output to forecast supply vs. demand gaps and inventory position"
    },
    {
        "title": "Barista",
        "location": "PHL - Bryn Mawr - Bryn Mawr, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=54785&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "As a barista at La Colombe you're responsible for maintaining the overall feel of your cafe. You will be the eyes and ears of the operation - the face of the space. You are responsible for maintaining the La Colombe experience for our customers.\rJOB REQUIREMENTSRegularly required to handle hot beverages\rBasic money handling skills\rBasic understanding of computer POS system\rFrequently required to use hand and finger motions, handle or feel objects, reach with hands and arms.\rAble to stand for long hours\rAble to lift and carry up to 40 lbs\rHigh organizational ability and detail oriented\rExcellent communication skills\rReliableESSENTIAL FUNCTIONS\rEssential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the jobs purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions for which the person in the job is held accountable. Following are the essential functions of the job.\rWelcomes customers by determining their coffee interest and needs\rTake customers orders accurately. Responds proactively to prevent customer service situations\rOperates coffee grinder, brewer and espresso machines; cleans machinery as needed.\rPrepares and sells coffee drinks by following recipes and preparation techniques for different coffee drinks.\rAble to work in a high volume, fast paced environment\rMaintains safe and healthy work environment by following organization standards and sanitation regulations.\rMaintaining and improving the appearance of store and coffee bar.\rRecord and accurately process purchases using the POS system, collect and process payments from the customer including cash, credit and debit cards."
    },
    {
        "title": "Barista",
        "location": "PHL - Fishtown - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=54578&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "As a barista at La Colombe you're responsible for maintaining the overall feel of your cafe. You will be the eyes and ears of the operation - the face of the space. You are responsible for maintaining the La Colombe experience for our customers.\rJOB REQUIREMENTSRegularly required to handle hot beverages\rBasic money handling skills\rBasic understanding of computer POS system\rFrequently required to use hand and finger motions, handle or feel objects, reach with hands and arms.\rAble to stand for long hours\rAble to lift and carry up to 40 lbs\rHigh organizational ability and detail oriented\rExcellent communication skills\rReliableESSENTIAL FUNCTIONS\rEssential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the jobs purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions for which the person in the job is held accountable. Following are the essential functions of the job.\rWelcomes customers by determining their coffee interest and needs\rTake customers orders accurately. Responds proactively to prevent customer service situations\rOperates coffee grinder, brewer and espresso machines; cleans machinery as needed.\rPrepares and sells coffee drinks by following recipes and preparation techniques for different coffee drinks.\rAble to work in a high volume, fast paced environment\rMaintains safe and healthy work environment by following organization standards and sanitation regulations.\rMaintaining and improving the appearance of store and coffee bar.\rRecord and accurately process purchases using the POS system, collect and process payments from the customer including cash, credit and debit cards."
    },
    {
        "title": "Barista",
        "location": "PHL - Indy - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=54442&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "As a barista at La Colombe you're responsible for maintaining the overall feel of your cafe. You will be the eyes and ears of the operation - the face of the space. You are responsible for maintaining the La Colombe experience for our customers.JOB REQUIREMENTSRegularly required to handle hot beverages\rBasic money handling skills\rBasic understanding of computer POS system\rFrequently required to use hand and finger motions, handle or feel objects, reach with hands and arms.\rAble to stand for long hours\rAble to lift and carry up to 40 lbs\rHigh organizational ability and detail oriented\rExcellent communication skills\rReliableESSENTIAL FUNCTIONS\rEssential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the jobs purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions for which the person in the job is held accountable. Following are the essential functions of the job.\rWelcomes customers by determining their coffee interest and needs\rTake customers orders accurately. Responds proactively to prevent customer service situations\rOperates coffee grinder, brewer and espresso machines; cleans machinery as needed.\rPrepares and sells coffee drinks by following recipes and preparation techniques for different coffee drinks.\rAble to work in a high volume, fast paced environment\rMaintains safe and healthy work environment by following organization standards and sanitation regulations.\rMaintaining and improving the appearance of store and coffee bar.\rRecord and accurately process purchases using the POS system, collect and process payments from the customer including cash, credit and debit cards."
    },
    {
        "title": "Porter",
        "location": "PHL - Fishtown - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=54132&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "Job Description: As an important member of La Colombe’s Flagship Café in Fishtown, the Porter / Prep Person plays a crucial role in ensuring the cleanliness, organization, and efficiency of the operation. In addition to Porter responsibilities, this role will also assist with kitchen prep on an as-needed basis. Duties and ResponsibilitiesWash dishes from the cafe/restaurant/kitchen using a dish washing machine and a 3-compartment sink, while ensuring proper chemical levels, water temperature, and cleanliness of the dish washing operationEnsure the facility’s cleanliness by checking the cafe floor, bathroom, dry storage area, trash room, etc., and performing spot cleaning as neededMaintain the facility’s general appearance and functioning by replacing light bulbs, removing and replacing trash, recycling, and linen receptacles, stocking restrooms as needed, and ensuring that sidewalks are kept cleanAdditional kitchen prep duties as directed"
    },
    {
        "title": "Sales Rep- Emerging Market - Chicago, IL - Midwest",
        "location": "CHI - Roastery - Chicago, IL",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=50451&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "At La Colombe we believe that being a good coffee partner means more than just offering a great cup of coffee. The Wholesale Team supports the city’s most talented chefs, restaurateurs, cafes, offices and hotels to ensure they execute consistent, high quality coffee programs. An emerging market sales rep is responsible for increasing our footprint in an uncharted area. The Sales Representative will own the customer experience, assisting clients to implement and maintain a coffee program that meets La Colombe’s standard of excellence. Source, convert, and onboard new clients to meet business targets. Train and educate client staff on a routine basis in line with specialty coffee techniques. Visit clients, providing preventative maintenance and quality control on a regular cadence. Develop ownership of relationships with key hospitality professionals.  The Sales Representative will display grace under pressure, eagerness to undertake difficult tasks, and a sense of urgency when needed. At La Colombe, no task is too small and the Sales Representative should embody this in all client interactions.  AREAS OF IMPACT SALES Work with Market Sales Manager to target high value leads. Utilize CRM tools to track leads through the sales process and use La Colombe methodology to qualify leads. Negotiate and execute contracts in line with the equipment lending model. Create customized proposals to convert qualified leads into new clients and win business. Collaborate with the Market Sales Manager to develop and implement a strategy to win additional business with key accounts in the market.  CUSTOMER SERVICE Deliver the highest degree of customer service at every stage in the customer experience with thorough, reliable, and timely responses. Communicate in a professional manner with client stakeholders at manager, executive, and ownership levels. Anticipate and proactively take charge of difficult situations finding solutions for clients in line with La Colombe’s resources.  ACCOUNT MANAGEMENT Train baristas, service staff, and management on brewing techniques, extraction theory, and equipment maintenance. Host presentations, tastings, and demonstrations for groups of all sizes. Provide routine quality control and preventative maintenance visits. Assist technician during installs, recipe setting, calibration, and technical service requests. Proactively manage accounts on a day-to-day basis. The aforementioned responsibilities are client facing and in the field. PROJECT MANAGEMENT Provide consultation on all aspects of the coffee business; coffee equipment, product choice, layout design, and general business insights. Communicate and interact effectively with internal departments including client services, technical services, production, marketing, and retail. Work with the Food Service and National Accounts teams to execute complex deals. Maintain a flexible schedule allowing for, when needed, periodic travel, weekends, and after-hours work.  INDUSTRY KNOWLEDGE Stay current on new restaurant and hotel openings both locally and nationally. Participate in coffee related events including trade shows, throwdowns, seminars, and other after hours events. Seek out new coffee products, equipment, and industry trends. Establish relationships with chefs, managers, and hospitality staff to improve the network."
    },
    {
        "title": "Barista",
        "location": "BOS - Seaport - Boston, MA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=50107&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "As a barista at La Colombe you're responsible for maintaining the overall feel of your cafe. You will be the eyes and ears of the operation - the face of the space. You are responsible for maintaining the La Colombe experience for our customers.\rJOB REQUIREMENTSRegularly required to handle hot beverages\rBasic money handling skills\rBasic understanding of computer POS system\rFrequently required to use hand and finger motions, handle or feel objects, reach with hands and arms.\rAble to stand for long hours\rAble to lift and carry up to 40 lbs\rHigh organizational ability and detail oriented\rExcellent communication skills\rReliableESSENTIAL FUNCTIONS\rEssential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the jobs purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions for which the person in the job is held accountable. Following are the essential functions of the job.\rWelcomes customers by determining their coffee interest and needs\rTake customers orders accurately. Responds proactively to prevent customer service situations\rOperates coffee grinder, brewer and espresso machines; cleans machinery as needed.\rPrepares and sells coffee drinks by following recipes and preparation techniques for different coffee drinks.\rAble to work in a high volume, fast paced environment\rMaintains safe and healthy work environment by following organization standards and sanitation regulations.\rMaintaining and improving the appearance of store and coffee bar.\rRecord and accurately process purchases using the POS system, collect and process payments from the customer including cash, credit and debit cards."
    },
    {
        "title": "Barista",
        "location": "NYC Area - New York City, NY",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=43257&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "Expected pay scale position; $16-18/hr, + tipsAs a barista at La Colombe you're responsible for maintaining the overall feel of your cafe. You will be the eyes and ears of the operation - the face of the space. You are responsible for maintaining the La Colombe experience for our customers.\rJOB REQUIREMENTSRegularly required to handle hot beverages\rBasic money handling skills\rBasic understanding of computer POS system\rFrequently required to use hand and finger motions, handle or feel objects, reach with hands and arms.\rAble to stand for long hours\rAble to lift and carry up to 40 lbs\rHigh organizational ability and detail oriented\rExcellent communication skills\rReliableESSENTIAL FUNCTIONS\rEssential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the jobs purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions for which the person in the job is held accountable. Following are the essential functions of the job.\rWelcomes customers by determining their coffee interest and needs\rTake customers orders accurately. Responds proactively to prevent customer service situations\rOperates coffee grinder, brewer and espresso machines; cleans machinery as needed.\rPrepares and sells coffee drinks by following recipes and preparation techniques for different coffee drinks.\rAble to work in a high volume, fast paced environment\rMaintains safe and healthy work environment by following organization standards and sanitation regulations.\rMaintaining and improving the appearance of store and coffee bar.\rRecord and accurately process purchases using the POS system, collect and process payments from the customer including cash, credit and debit cards."
    },
    {
        "title": "Receiving Coordinator - Nights",
        "location": "MI Warehouse Facility - Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=39130&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "Supports the quality system knowledge including the quality manual, quality policy, and applicable procedures and work instructionsEnsures products and supplies are unloaded, received, and loaded on the dock in an efficient, accurate and safe mannerResponsible for skid wrapping where requiredVerifies packing slips for correct products and amountsCompletes all necessary paperwork and filing in complete and accurate mannerAccurately prints and labels productCoordinates placement of raw materials, supplies, and finished goods in proper location after inspections are completedWeekly/Month-End department cycle counts as requiredConstant communication with Logistics team and all Production departmentsParticipates positively in department meetingsOperates HiLo, pallet jacks and other machinery in a safe manner at all timesReports safety concerns to supervisorCross trains with Warehouse positions and fills in as neededMaintains and displays strong attendance habits by being present and on timeAbility to work a rotating 12-hour shift schedule, including every other weekend and possibly holidays, to support our 24/7 production and logistics schedule*This is a newly formed position, and all responsibilities/duties are subject to change*"
    },
    {
        "title": "Shipping & Receiving Associate",
        "location": "PHL - Salmon St - Philadelphia, PA",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=36008&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "We are looking for a person with forklift experience to work flexibly between our brewing team and our shipping and receiving needs. Shipping and receiving needs more help in the morning and brewing needs more help in the afternoon.The Brewer is responsible for blending the coffee and other ingredients together per the Standard Operating Procedure. The brewer will work directly with the Brew lead on ensuring quality and consistency throughout the process. The brewer is also responsible for communicating to the process team on the pasteurization procedure for each tank.Essential Duties and Responsibilities:Control flow of concentrateWork with R&D team on continuous improvementMix and blend ingredients to create various batchesSet equipment parameters for operationPerform quality checks as requiredPerform sanitationInventory and control ingredientsMaintain records dailyOperate forklift truckFollow all policies and procedures, including Safety"
    },
    {
        "title": "Coffee Machine Field ServiceTechnician - DC Region",
        "location": "Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=35128&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "Coffee Field Service Technicians are responsible for installing and servicing coffee equipment for existing and new clients.\rOther duties include but are not limited to:● Bench testing new equipment upon delivery prior to installation.\r● Refurbishment of used coffee equipment to extend the useful life/prepare for installation.\r● Removal of equipment or switch-outs\r● Digitally documenting service / installations This position's geographic territory will be focused on the DC metro area but may expand as management requires."
    },
    {
        "title": "Barista - New York",
        "location": "Norton Shores, MI",
        "url": "https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=3355&clientkey=23A6869F7C07237B81D99DE63F43D694",
        "description": "As a barista at La Colombe you're responsible for maintaining the overall feel of your cafe. You will be the eyes and ears of the operation - the face of the space. You are responsible for maintaining the La Colombe experience for our customers.\rJOB REQUIREMENTSRegularly required to handle hot beverages\rBasic money handling skills\rBasic understanding of computer POS system\rFrequently required to use hand and finger motions, handle or feel objects, reach with hands and arms.\rAble to stand for long hours\rAble to lift and carry up to 40 lbs\rHigh organizational ability and detail oriented\rExcellent communication skills\rReliableESSENTIAL FUNCTIONS\rEssential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the jobs purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions for which the person in the job is held accountable. Following are the essential functions of the job.\rWelcomes customers by determining their coffee interest and needs\rTake customers orders accurately. Responds proactively to prevent customer service situations\rOperates coffee grinder, brewer and espresso machines; cleans machinery as needed.\rPrepares and sells coffee drinks by following recipes and preparation techniques for different coffee drinks.\rAble to work in a high volume, fast paced environment\rMaintains safe and healthy work environment by following organization standards and sanitation regulations.\rMaintaining and improving the appearance of store and coffee bar.\rRecord and accurately process purchases using the POS system, collect and process payments from the customer including cash, credit and debit cards."
    }
]